#include"GameMainScene.h"
#include"DxLib.h"
#include"Block.h"
#include"SceneManager.h"

/********************************
*マクロ定義
*********************************/



/********************************
*型定義
*********************************/



/********************************
*グローバル変数宣言
*********************************/
int backGround_image;           //背景画像イメージ
int BackGround_sound;           //BGM
int GameOver_sound;             //ゲームオーバー
int Score;                      //スコア

/********************************
*プロトタイプ宣言
*********************************/










































